# exiting = 0
# while exiting != 1:
#     try:
#         usr = float(input("введите число: "))
#         # usr2 = float(input("введите второе число: "))
#         exiting = 1
#     except:
#         print('неверный формат. повторите')

#     # можно корректные данные записывать в список и 
#     # затем проверять если в списке по индексу есть данные, 
#     # если есть - не спрашивать их еще раз
#     # если данных нет - заново ввести.
#     # таким образом будет проведена проверка на корректный ввод данных и 
#     # юзеру не нужно вводить все данные заново
#     # только недостающие 
